probonopd/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
void authHandler(String user, String uri) {
  // On the real bridge, the link button on the bridge must have been recently pressed for the command to execute successfully.
  // We try to execute successfully regardless of a button for now.
  isAuthorized = true; // FIXME: Instead, we should persist (save) the username and put it on the whitelist
  String username = "api";
  Serial.println("CLIENT: ");
  Serial.println(username);

  sendSuccess("username", username);
}

void lightsHandler(String user, String uri) {
  uri = trimSlash(uri.substring(6));
  if (uri == "") {
    switch (HTTP.method()) {
      case HTTP_GET: {
          // dump existing lights
          aJsonObject *lights = aJson.createObject();
          addLightsJson(lights);
          sendJson(lights);
          break;
        }
      case HTTP_POST: {
          // "start" a "search" for "new" lights
          sendSuccess("/lights", "Searching for new devices");
          break;
        }
    }
    return;
  }
  if (uri == "new") {
    // dump empty object
    aJsonObject *lights = aJson.createObject();
    sendJson(lights);
    return;
  }

  // individual light state request
  if (uri.endsWith("state")) {
    // remove "/state"
    String lightText = uri.substring(0, uri.length() - 6);
    int numberOfTheLight = atoi(lightText.c_str()) - 1;

    Serial.print("JSON Body:");
    Serial.println(HTTP.arg("plain"));
    aJsonObject* parsedRoot = aJson.parse(( char*) HTTP.arg("plain").c_str());
    LightHandler *handler = LightService.getLightHandler(numberOfTheLight);
    if (!handler) {
      sendError(3, uri, "Requested light not available");
      return;
    }
    HueLightInfo currentInfo = handler->getInfo(numberOfTheLight);
    if (parsedRoot) {
      HueLightInfo newInfo;
      if (!parseHueLightInfo(currentInfo, parsedRoot, &newInfo)) {
        aJson.deleteItem(parsedRoot);
        return;
      }
      handler->handleQuery(numberOfTheLight, newInfo, parsedRoot);
      aJson.deleteItem(parsedRoot);
    } else if (HTTP.arg("plain") != "") {
      // unparseable json
      sendError(2, "groups/0/action", "Bad JSON body in request");
      return;
    }

    aJsonObject *root;
    root = aJson.createObject();
    addLightJson(root, numberOfTheLight, handler);
    sendJson(root);
  }
}

aJsonObject *validateGroupCreateBody(String body) {
  aJsonObject *root = aJson.parse(( char*) body.c_str());
  aJsonObject* jName = aJson.getObjectItem(root, "name");
  aJsonObject* jLights = aJson.getObjectItem(root, "lights");
  if (!jName || !jLights) {
    return nullptr;
  }
  return root;
}

void applyConfigToLightMask(unsigned int lights) {
  Serial.print("JSON Body:");
  Serial.println(HTTP.arg("plain"));
  aJsonObject* parsedRoot = aJson.parse(( char*) HTTP.arg("plain").c_str());
  if (parsedRoot) {
    for (int i = 0; i < LightService.getLightsAvailable(); i++) {
      LightHandler *handler = LightService.getLightHandler(i);
      HueLightInfo currentInfo = handler->getInfo(i);
      HueLightInfo newInfo;
      if (parseHueLightInfo(currentInfo, parsedRoot, &newInfo)) {
        handler->handleQuery(i, newInfo, parsedRoot);
      }
    }
    aJson.deleteItem(parsedRoot);

    // As per the spec, the response can be "Updated." for memory-constrained devices
    sendUpdated();
  } else if (HTTP.arg("plain") != "") {
    // unparseable json
    sendError(2, "groups/0/action", "Bad JSON body in request");
  }
}

class LightGroup {
  public:
    LightGroup(aJsonObject *root) {
      aJsonObject* jName = aJson.getObjectItem(root, "name");
      aJsonObject* jLights = aJson.getObjectItem(root, "lights");
      // jName and jLights guaranteed to exist
      name = jName->valuestring;
      for (int i = 0; i < aJson.getArraySize(jLights); i++) {
        aJsonObject* jLight = aJson.getArrayItem(jLights, i);
        // lights are 1-based and map to the 0-based bitfield
        int lightNum = atoi(jLight->valuestring);
        if (lightNum != 0) {
          lights |= (1 << (lightNum - 1));
        }
      }
    }
    aJsonObject *getJson() {
      aJsonObject *object = aJson.createObject();
      aJson.addStringToObject(object, "name", name.c_str());
      aJsonObject *lightsArray = aJson.createArray();
      aJson.addItemToObject(object, "lights", lightsArray);
      for (int i = 0; i < 16; i++) {
        if (!((1 << i) & lights)) {
          continue;
        }
        // add light to list
        String lightNum = "";
        lightNum += (i + 1);
        aJson.addItemToArray(lightsArray, aJson.createItem(lightNum.c_str()));
      }
      return object;
    }
    unsigned int getLightMask() {
      return lights;
    }
  private:
    String name;
    // use unsigned int to hold members of this group. 2 bytes -> supports up to 16 lights
    unsigned int lights = 0;
    // no need to hold the group type, only LightGroup is supported for API 1.4
};

LightGroup *lightGroups[16] = {nullptr, };

// returns true on failure
bool updateGroupSlot(int slot, String body) {
  aJsonObject *root;
  if (body != "") {
    Serial.print("JSON Body:");
    Serial.println(body);
    root = validateGroupCreateBody(body);
  }
  if (!root && body != "") {
    // throw error bad body
    sendError(2, "groups/" + (slot + 1), "Bad JSON body");
    return true;
  }
  if (lightGroups[slot]) {
    delete lightGroups[slot];
    lightGroups[slot] = nullptr;
  }
  if (body != "") {
    lightGroups[slot] = new LightGroup(root);
    aJson.deleteItem(root);
  }
  return false;
}

void groupCreationHandler() {
  // handle group creation
  // find first available group slot
  int availableSlot = -1;
  for (int i = 0; i < 16; i++) {
    if (!lightGroups[i]) {
      availableSlot = i;
      break;
    }
  }
  if (availableSlot == -1) {
    // throw error no new groups allowed
    sendError(301, "groups", "Groups table full");
    return;
  }
  if (!updateGroupSlot(availableSlot, HTTP.arg("plain"))) {
    String slot = "";
    slot += (availableSlot + 1);
    sendSuccess("id", slot);
  }
}

void groupListingHandler() {
  // iterate over groups and serialize
  aJsonObject *root = aJson.createObject();
  for (int i = 0; i < 16; i++) {
    if (lightGroups[i]) {
      String sIndex = "";
      sIndex += (i + 1);
      aJson.addItemToObject(root, sIndex.c_str(), lightGroups[i]->getJson());
    }
  }
  sendJson(root);
}

void groupsHandler(String user, String uri) {
  uri = trimSlash(uri.substring(6));
  if (uri == "") {
    switch (HTTP.method()) {
      case HTTP_GET:
        groupListingHandler();
        break;
      case HTTP_POST:
        groupCreationHandler();
        break;
      default:
        sendError(4, "/api/" + user + "/groups", "Group method not supported");
        break;
    }
    return;
  }

