probonopd/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
  int nextSlash = uri.indexOf("/");
  int groupNum = -1;
  String groupNumText;
  if (nextSlash == -1) {
    groupNumText = uri;
    uri = "";
  } else {
    groupNumText = uri.substring(0, nextSlash);
    uri = trimSlash(uri.substring(nextSlash));
  }
  groupNum = atoi(groupNumText.c_str()) - 1;
  if ((groupNum == -1 && groupNumText != "0") || groupNum >= 16 || (groupNum >= 0 && !lightGroups[groupNum])) {
    // error, invalid group number
    String resource = "/api/";
    resource += user;
    resource += "/groups/";
    resource += groupNumText;
    sendError(3, resource, "Invalid group number");
    return;
  }

  if (uri == "") {
    switch (HTTP.method()) {
      case HTTP_GET:
        if (groupNum != -1) {
          sendJson(lightGroups[groupNum]->getJson());
        } else {
          aJsonObject *object = aJson.createObject();
          aJson.addStringToObject(object, "name", "0");
          aJsonObject *lightsArray = aJson.createArray();
          aJson.addItemToObject(object, "lights", lightsArray);
          for (int i = 0; i < MAX_LIGHT_HANDLERS; i++) {
            if (!lightHandlers[i]) {
              continue;
            }
            // add light to list
            String lightNum = "";
            lightNum += (i + 1);
            aJson.addItemToArray(lightsArray, aJson.createItem(lightNum.c_str()));
          }
          sendJson(object);
        }
        break;
      case HTTP_PUT:
        // validate body, delete old group, create new group
        updateGroupSlot(groupNum, HTTP.arg("plain"));
        sendUpdated();
        break;
      case HTTP_DELETE:
        updateGroupSlot(groupNum, "");
        break;
      default:
        sendError(4, "/api/" + user + "/groups", "Group method not supported");
        break;
    }
    return;
  }

  if (uri == "action") {
    if (HTTP.method() != HTTP_PUT) {
      // error, only PUT allowed
      sendError(4, "/api/" + user + "/groups/" + groupNum + "/action", "Only PUT supported for groups/*/action");
      return;
    }
    // parse input as if for all lights
    unsigned int lightMask;
    if (groupNum == -1) {
      lightMask == 0xFFFF;
    } else {
      lightMask = lightGroups[groupNum]->getLightMask();
    }
    // apply to group
    applyConfigToLightMask(lightMask);
  }
}

void scenesHandler(String user, String uri) {
  uri = trimSlash(uri.substring(6));
  if (uri == "" && HTTP.method() == HTTP_GET) {
    HTTP.send(200, "text/plain", "{}");
    return;
  }
  // no part of /api/user/scenes is supported, so all methods are unsupported
  sendError(4, "/api/" + user + "/" + uri, "Method not supported for scenes");
}

void wholeConfigHandler(String user, String uri) {
  // Serial.println("Respond with complete json as in https://github.com/probonopd/ESP8266HueEmulator/wiki/Hue-API#get-all-information-about-the-bridge");
  aJsonObject *root;
  root = aJson.createObject();
  aJsonObject *groups;
  // the default group 0 is never listed
  aJson.addItemToObject(root, "groups", groups = aJson.createObject());
  aJsonObject *scenes;
  aJson.addItemToObject(root, "scenes", scenes = aJson.createObject());
  aJsonObject *config;
  aJson.addItemToObject(root, "config", config = aJson.createObject());
  addConfigJson(config);
  aJsonObject *lights;
  aJson.addItemToObject(root, "lights", lights = aJson.createObject());
  addLightsJson(lights);
  aJsonObject *schedules;
  aJson.addItemToObject(root, "schedules", schedules = aJson.createObject());
  sendJson(root);
}

void descriptionHandler(String user, String uri) {
  WiFiClient client = HTTP.client();
  String str = "<root><specVersion><major>1</major><minor>0</minor></specVersion><URLBase>http://" + ipString + ":80/</URLBase><device><deviceType>urn:schemas-upnp-org:device:Basic:1</deviceType><friendlyName>Philips hue (" + ipString + ")</friendlyName><manufacturer>Royal Philips Electronics</manufacturer><manufacturerURL>http://www.philips.com</manufacturerURL><modelDescription>Philips hue Personal Wireless Lighting</modelDescription><modelName>Philips hue bridge 2012</modelName><modelNumber>929000226503</modelNumber><modelURL>http://www.meethue.com</modelURL><serialNumber>00178817122c</serialNumber><UDN>uuid:2f402f80-da50-11e1-9b23-00178817122c</UDN><presentationURL>index.html</presentationURL><iconList><icon><mimetype>image/png</mimetype><height>48</height><width>48</width><depth>24</depth><url>hue_logo_0.png</url></icon><icon><mimetype>image/png</mimetype><height>120</height><width>120</width><depth>24</depth><url>hue_logo_3.png</url></icon></iconList></device></root>";
  HTTP.send(200, "text/plain", str);
  Serial.println(str);
}

String methodToString(int method) {
  switch (method) {
    case HTTP_POST: return "POST";
    case HTTP_GET: return "GET";
    case HTTP_PUT: return "PUT";
    case HTTP_PATCH: return "PATCH";
    case HTTP_DELETE: return "DELETE";
    case HTTP_OPTIONS: return "OPTIONS";
    default: return "unknown";
  }
}

void handleAllOthers() {
  Serial.print("=== ");
  Serial.println(millis());
  Serial.print("Method: ");
  Serial.println(methodToString(HTTP.method()));
  String fullUri = trimSlash(HTTP.uri());
  Serial.print("requestedUri: ");
  Serial.println(fullUri);

  if (fullUri == "description.xml") {
    descriptionHandler("", fullUri);
    Serial.println(millis());
    return;
  }

  // make sure /api is there, rip it off along with trailing slash if present
  if (!fullUri.startsWith("api")) {
    // bail, unimplemented
    HTTP.send(200, "text/plain", "{}");
    Serial.println("FIXME: To be implemented");
    return;
  }
  fullUri.remove(0, 3);
  fullUri = trimSlash(fullUri);
  // get user
  String user;
  int userEnd = fullUri.indexOf('/');
  if (userEnd == -1) {
    user = fullUri;
    fullUri = "";
  } else {
    user = fullUri.substring(0, userEnd);
    fullUri.remove(0, userEnd);
  }
  String requestedUri = trimSlash(fullUri);
  if (requestedUri.endsWith("/")) {
    requestedUri = requestedUri.substring(0, requestedUri.length() - 1);
  }
  // requestedUri is remaining path, no leading or trailing slash
  Serial.print("URI: ");
  Serial.println(requestedUri);

  if ( requestedUri == "config" || (requestedUri == "" && user == "config") ) {
    configHandler(user, requestedUri);
  } else if (requestedUri == "") {
    if (user == "") {
      authHandler(user, requestedUri);
    } else {
      wholeConfigHandler(user, requestedUri);
    }
  } else if (requestedUri.startsWith("lights")) {
    lightsHandler(user, requestedUri);
  } else if (requestedUri.startsWith("groups")) {
    groupsHandler(user, requestedUri);
  } else if (requestedUri.startsWith("scenes")) {
    scenesHandler(user, requestedUri);
  } else {
    HTTP.send(200, "text/plain", "()");
    Serial.println("FIXME: To be implemented");

    // Print what the client has POSTed
    for (uint8_t i = 0; i < HTTP.args(); i++) Serial.printf("ARG[%u]: %s=%s\n", i, HTTP.argName(i).c_str(), HTTP.arg(i).c_str());
  }
  Serial.println(millis());
}

